Ran Plan for 5 projects:

1. project: `general` dir: `terraform/general` workspace: `default`
1. project: `production` dir: `terraform/production` workspace: `default`
1. project: `sandbox` dir: `terraform/sandbox` workspace: `default`
1. project: `staging` dir: `terraform/staging` workspace: `default`
1. project: `qa` dir: `terraform/qa` workspace: `default`

### 1. project: `general` dir: `terraform/general` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.circleci.data.aws_caller_identity.dev: Reading...
module.circleci.data.aws_region.dev: Reading...
module.circleci.data.aws_region.dev: Read complete after 0s [id=us-east-1]
module.circleci.data.aws_caller_identity.dev: Read complete after 0s [id=571579881413]
data.aws_iam_policy_document.deploy_s3_main: Reading...
data.aws_iam_policy_document.deploy_s3_dev: Reading...
module.circleci.data.aws_region.main: Reading...
module.circleci.data.aws_caller_identity.main: Reading...
module.circleci.data.aws_iam_policy_document.deploy_cerbos_s3_dev: Reading...
data.aws_iam_policy_document.deploy_s3_main: Read complete after 0s [id=409411506]
module.circleci.data.aws_iam_policy_document.deploy_cerbos_s3: Reading...
module.circleci.data.aws_iam_policy_document.deploy_cerbos_s3_dev: Read complete after 0s [id=2952504999]
data.aws_iam_policy_document.deploy_s3_dev: Read complete after 0s [id=3675913982]
module.circleci.data.aws_region.main: Read complete after 0s [id=us-east-1]
module.circleci.data.aws_iam_policy_document.deploy_cerbos_s3: Read complete after 0s [id=2721082063]
module.circleci.data.aws_caller_identity.main: Read complete after 0s [id=845156828388]
module.circleci.data.aws_secretsmanager_secret.r2d2_secrets: Reading...
module.circleci.data.aws_s3_bucket.backstage_techdocs: Reading...
module.circleci.data.aws_caller_identity.loadsmart_main: Reading...
module.circleci.data.aws_s3_bucket.software_architecture_artifacts: Reading...
module.circleci.data.aws_region.loadsmart_main: Reading...
module.circleci.data.aws_secretsmanager_secret.walle_secret: Reading...
module.circleci.data.aws_region.loadsmart_main: Read complete after 0s [id=us-east-1]
module.circleci.data.aws_caller_identity.loadsmart_main: Read complete after 0s [id=845156828388]
module.circleci.data.aws_s3_bucket.software_architecture_artifacts: Read complete after 0s [id=software-architecture-mapping]
module.circleci.data.aws_secretsmanager_secret.walle_secret: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:845156828388:secret:walle/production/app-dKVvHo]
module.circleci.data.aws_secretsmanager_secret.r2d2_secrets: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:845156828388:secret:r2d2/production/app-MbtngZ]
module.circleci.data.aws_secretsmanager_secret_version.waller_secret: Reading...
module.circleci.data.aws_secretsmanager_secret_version.r2d2_secrets: Reading...
module.circleci.data.aws_s3_bucket.backstage_techdocs: Read complete after 0s [id=ls-backstage-techdocs]
module.circleci.data.aws_secretsmanager_secret_version.waller_secret: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:845156828388:secret:walle/production/app-dKVvHo|AWSCURRENT]
module.circleci.data.aws_secretsmanager_secret_version.r2d2_secrets: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:845156828388:secret:r2d2/production/app-MbtngZ|AWSCURRENT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_user_policy.deploy_s3_dev will be created
+ resource "aws_iam_user_policy" "deploy_s3_dev" {
+       id          = (known after apply)
+       name        = "S3Deployment"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:PutObject*",
+                           "s3:List*",
+                           "s3:Head*",
+                           "s3:GetObject*",
+                           "s3:DeleteObject*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-staging/*",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-staging",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-qa/*",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-qa",
                        ]
+                       Sid      = "S3Deploy"
                    },
+                   {
+                       Action   = [
+                           "cloudfront:ListInvalidations",
+                           "cloudfront:GetInvalidation",
+                           "cloudfront:CreateInvalidation",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "CloudFrontInvalidation"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       user        = "circleci-ls-analytics-web"
    }

  # aws_iam_user_policy.deploy_s3_main will be created
+ resource "aws_iam_user_policy" "deploy_s3_main" {
+       id          = (known after apply)
+       name        = "S3Deployment"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:PutObject*",
+                           "s3:List*",
+                           "s3:Head*",
+                           "s3:GetObject*",
+                           "s3:DeleteObject*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-sandbox/*",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-sandbox",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-production/*",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-production",
                        ]
+                       Sid      = "S3Deploy"
                    },
+                   {
+                       Action   = [
+                           "cloudfront:ListInvalidations",
+                           "cloudfront:GetInvalidation",
+                           "cloudfront:CreateInvalidation",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "CloudFrontInvalidation"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       user        = "circleci-ls-analytics-web"
    }

  # sentry_key.production will be created
+ resource "sentry_key" "production" {
+       dsn_csp           = (known after apply)
+       dsn_public        = (known after apply)
+       dsn_secret        = (known after apply)
+       id                = (known after apply)
+       is_active         = (known after apply)
+       name              = "production"
+       organization      = "loadsmart"
+       project           = "ls-analytics-web"
+       project_id        = (known after apply)
+       public            = (known after apply)
+       rate_limit_count  = 30
+       rate_limit_window = 60
+       secret            = (known after apply)
    }

  # sentry_key.qa will be created
+ resource "sentry_key" "qa" {
+       dsn_csp           = (known after apply)
+       dsn_public        = (known after apply)
+       dsn_secret        = (known after apply)
+       id                = (known after apply)
+       is_active         = (known after apply)
+       name              = "qa"
+       organization      = "loadsmart"
+       project           = "ls-analytics-web"
+       project_id        = (known after apply)
+       public            = (known after apply)
+       rate_limit_count  = 30
+       rate_limit_window = 60
+       secret            = (known after apply)
    }

  # sentry_key.sandbox will be created
+ resource "sentry_key" "sandbox" {
+       dsn_csp           = (known after apply)
+       dsn_public        = (known after apply)
+       dsn_secret        = (known after apply)
+       id                = (known after apply)
+       is_active         = (known after apply)
+       name              = "sandbox"
+       organization      = "loadsmart"
+       project           = "ls-analytics-web"
+       project_id        = (known after apply)
+       public            = (known after apply)
+       rate_limit_count  = 30
+       rate_limit_window = 60
+       secret            = (known after apply)
    }

  # sentry_key.staging will be created
+ resource "sentry_key" "staging" {
+       dsn_csp           = (known after apply)
+       dsn_public        = (known after apply)
+       dsn_secret        = (known after apply)
+       id                = (known after apply)
+       is_active         = (known after apply)
+       name              = "staging"
+       organization      = "loadsmart"
+       project           = "ls-analytics-web"
+       project_id        = (known after apply)
+       public            = (known after apply)
+       rate_limit_count  = 30
+       rate_limit_window = 60
+       secret            = (known after apply)
    }

  # sentry_project.default will be created
+ resource "sentry_project" "default" {
+       color             = (known after apply)
+       default_key       = true
+       default_rules     = true
+       digests_max_delay = (known after apply)
+       digests_min_delay = (known after apply)
+       features          = (known after apply)
+       id                = (known after apply)
+       internal_id       = (known after apply)
+       is_bookmarked     = (known after apply)
+       is_public         = (known after apply)
+       name              = "ls-analytics-web"
+       organization      = "loadsmart"
+       platform          = (known after apply)
+       project_id        = (known after apply)
+       resolve_age       = (known after apply)
+       slug              = "ls-analytics-web"
+       status            = (known after apply)
+       team              = "data-engineering"
    }

  # module.circleci.aws_iam_access_key.dev_key[0] will be created
+ resource "aws_iam_access_key" "dev_key" {
+       create_date                    = (known after apply)
+       encrypted_secret               = (known after apply)
+       encrypted_ses_smtp_password_v4 = (known after apply)
+       id                             = (known after apply)
+       key_fingerprint                = (known after apply)
+       secret                         = (sensitive value)
+       ses_smtp_password_v4           = (sensitive value)
+       status                         = "Active"
+       user                           = "circleci-ls-analytics-web"
    }

  # module.circleci.aws_iam_access_key.key[0] will be created
+ resource "aws_iam_access_key" "key" {
+       create_date                    = (known after apply)
+       encrypted_secret               = (known after apply)
+       encrypted_ses_smtp_password_v4 = (known after apply)
+       id                             = (known after apply)
+       key_fingerprint                = (known after apply)
+       secret                         = (sensitive value)
+       ses_smtp_password_v4           = (sensitive value)
+       status                         = "Active"
+       user                           = "circleci-ls-analytics-web"
    }

  # module.circleci.aws_iam_user.dev_user[0] will be created
+ resource "aws_iam_user" "dev_user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "circleci-ls-analytics-web"
+       path          = "/"
+       tags_all      = (known after apply)
+       unique_id     = (known after apply)
    }

  # module.circleci.aws_iam_user.user[0] will be created
+ resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "circleci-ls-analytics-web"
+       path          = "/"
+       tags_all      = (known after apply)
+       unique_id     = (known after apply)
    }

  # module.circleci.aws_iam_user_policy.deploy_cerbos_s3[0] will be created
+ resource "aws_iam_user_policy" "deploy_cerbos_s3" {
+       id          = (known after apply)
+       name        = "S3Deployment"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:PutObject*"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::loadsmart-cerbos-policies-sandbox/ls-analytics-web/*",
+                           "arn:aws:s3:::loadsmart-cerbos-policies-production/ls-analytics-web/*",
                        ]
+                       Sid      = "S3Deploy"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       user        = "circleci-ls-analytics-web"
    }

  # module.circleci.aws_iam_user_policy.deploy_cerbos_s3_dev[0] will be created
+ resource "aws_iam_user_policy" "deploy_cerbos_s3_dev" {
+       id          = (known after apply)
+       name        = "S3Deployment"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:PutObject*"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::loadsmart-cerbos-policies-staging/ls-analytics-web/*",
+                           "arn:aws:s3:::loadsmart-cerbos-policies-qa/ls-analytics-web/*",
                        ]
+                       Sid      = "S3Deploy"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       user        = "circleci-ls-analytics-web"
    }

  # module.circleci.aws_iam_user_policy_attachment.ecr_read_only[0] will be created
+ resource "aws_iam_user_policy_attachment" "ecr_read_only" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       user       = "circleci-ls-analytics-web"
    }

  # module.circleci.circleci_project.project will be created
+ resource "circleci_project" "project" {
+       env_vars = (sensitive value)
+       id       = (known after apply)
+       name     = "ls-analytics-web"
    }

  # module.circleci.null_resource.enable_dynamic_config will be created
+ resource "null_resource" "enable_dynamic_config" {
+       id       = (known after apply)
+       triggers = {
+           "dynamic_config" = "true"
        }
    }

  # module.circleci.null_resource.walle_webhook will be created
+ resource "null_resource" "walle_webhook" {
+       id       = (known after apply)
+       triggers = {
+           "secret"   = (sensitive value)
+           "webhooks" = "https://walle.loadsmart.io/circleci"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.
╷
│ Warning: Reference to undefined provider
│ 
│   on main.tf line 31, in module "secrets_staging":
│   31:     aws = aws.dev
│ 
│ There is no explicit declaration for local provider name "aws" in
│ module.secrets_staging, so Terraform is assuming you mean to pass a
│ configuration for "hashicorp/aws".
│ 
│ If you also control the child module, add a required_providers entry named
│ "aws" with the source address "hashicorp/aws".
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Warning: Argument is deprecated
│ 
│   with sentry_project.default,
│   on sentry.tf line 4, in resource "sentry_project" "default":
│    4:   team = "data-engineering"
│ 
│ Use `teams` instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 17 to add, 0 to change, 0 to destroy.

---
### 2. project: `production` dir: `terraform/production` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.3.9 plan -input=false -refresh -out \"/atlantis-data/repos/loadsmart/ls-analytics-web/9/default/terraform/production/production-default.tfplan\"" in "/atlantis-data/repos/loadsmart/ls-analytics-web/9/default/terraform/production": exit status 1
╷
│ Error: Reference to undeclared resource
│ 
│   on ../modules/cdn/s3.tf line 63, in data "aws_iam_policy_document" "ls-analytics-web-bucket":
│   63:       aws_s3_bucket.ls-analytics-web-bucket.arn,
│ 
│ A managed resource "aws_s3_bucket" "ls-analytics-web-bucket" has not been
│ declared in module.website_cdn.
╵
╷
│ Error: Reference to undeclared resource
│ 
│   on ../modules/cdn/s3.tf line 64, in data "aws_iam_policy_document" "ls-analytics-web-bucket":
│   64:       "${aws_s3_bucket.ls-analytics-web-bucket.arn}/*",
│ 
│ A managed resource "aws_s3_bucket" "ls-analytics-web-bucket" has not been
│ declared in module.website_cdn.
╵

```
</details>

---
### 3. project: `sandbox` dir: `terraform/sandbox` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.3.9 plan -input=false -refresh -out \"/atlantis-data/repos/loadsmart/ls-analytics-web/9/default/terraform/sandbox/sandbox-default.tfplan\"" in "/atlantis-data/repos/loadsmart/ls-analytics-web/9/default/terraform/sandbox": exit status 1
╷
│ Error: Reference to undeclared resource
│ 
│   on ../modules/cdn/s3.tf line 63, in data "aws_iam_policy_document" "ls-analytics-web-bucket":
│   63:       aws_s3_bucket.ls-analytics-web-bucket.arn,
│ 
│ A managed resource "aws_s3_bucket" "ls-analytics-web-bucket" has not been
│ declared in module.website_cdn.
╵
╷
│ Error: Reference to undeclared resource
│ 
│   on ../modules/cdn/s3.tf line 64, in data "aws_iam_policy_document" "ls-analytics-web-bucket":
│   64:       "${aws_s3_bucket.ls-analytics-web-bucket.arn}/*",
│ 
│ A managed resource "aws_s3_bucket" "ls-analytics-web-bucket" has not been
│ declared in module.website_cdn.
╵

```
</details>

---
### 4. project: `staging` dir: `terraform/staging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.3.9 plan -input=false -refresh -out \"/atlantis-data/repos/loadsmart/ls-analytics-web/9/default/terraform/staging/staging-default.tfplan\"" in "/atlantis-data/repos/loadsmart/ls-analytics-web/9/default/terraform/staging": exit status 1
╷
│ Error: Reference to undeclared resource
│ 
│   on ../modules/cdn/s3.tf line 63, in data "aws_iam_policy_document" "ls-analytics-web-bucket":
│   63:       aws_s3_bucket.ls-analytics-web-bucket.arn,
│ 
│ A managed resource "aws_s3_bucket" "ls-analytics-web-bucket" has not been
│ declared in module.website_cdn.
╵
╷
│ Error: Reference to undeclared resource
│ 
│   on ../modules/cdn/s3.tf line 64, in data "aws_iam_policy_document" "ls-analytics-web-bucket":
│   64:       "${aws_s3_bucket.ls-analytics-web-bucket.arn}/*",
│ 
│ A managed resource "aws_s3_bucket" "ls-analytics-web-bucket" has not been
│ declared in module.website_cdn.
╵

```
</details>

---
### 5. project: `qa` dir: `terraform/qa` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.3.9 plan -input=false -refresh -out \"/atlantis-data/repos/loadsmart/ls-analytics-web/9/default/terraform/qa/qa-default.tfplan\"" in "/atlantis-data/repos/loadsmart/ls-analytics-web/9/default/terraform/qa": exit status 1
╷
│ Error: Reference to undeclared resource
│ 
│   on ../modules/cdn/s3.tf line 63, in data "aws_iam_policy_document" "ls-analytics-web-bucket":
│   63:       aws_s3_bucket.ls-analytics-web-bucket.arn,
│ 
│ A managed resource "aws_s3_bucket" "ls-analytics-web-bucket" has not been
│ declared in module.website_cdn.
╵
╷
│ Error: Reference to undeclared resource
│ 
│   on ../modules/cdn/s3.tf line 64, in data "aws_iam_policy_document" "ls-analytics-web-bucket":
│   64:       "${aws_s3_bucket.ls-analytics-web-bucket.arn}/*",
│ 
│ A managed resource "aws_s3_bucket" "ls-analytics-web-bucket" has not been
│ declared in module.website_cdn.
╵

```
</details>

---

